app/views/articles/_form.html.erb

SELECT "categories"."name", "categories"."id" FROM "categories"
---
    else
      data = Category.all.pluck(:name, :id)