app/views/orders/current_order.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 16]]
---
<div id="orders">
  <% @current_order.line_items.sort_by{|li| li.article.name}.each do |line_item| %>