app/controllers/articles_controller.rb

  def create
    @article = @category.article.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("name", "category_id", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Croissant"], ["category_id", 1], ["price", 230], ["created_at", "2023-09-08 09:43:39.615641"], ["updated_at", "2023-09-08 09:43:39.615641"]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "price" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["price", 100], ["updated_at", "2023-09-08 17:41:01.839205"], ["id", 4]]

  def set_category
    if params[:category_id]
      @category = Category.find(params[:category_id])
    elsif params.dig(:article, :category_id)
      @category = Category.find(params.dig(:article, :category_id))
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 4], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_article
    @article = @category.article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 4], ["LIMIT", 1]]