app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categorys = Category.all