app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("order_id", "article_id", "anzahl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", nil], ["article_id", 1], ["anzahl", 12], ["created_at", "2023-09-08 13:41:54.624215"], ["updated_at", "2023-09-08 13:41:54.624215"]]
---
  def create
    create_params = {order_id: @current_order.id}
    create_params = create_params.merge(line_item_params)
    @line_item = LineItem.create(create_params)