app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."order_id" = $1 LIMIT $2  [["order_id", "fe7b11c9-f2a9-4a52-9908-86729349751e"], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])