app/controllers/tables_controller.rb

  def index
    @tables = Table.all
---
SELECT "tables".* FROM "tables"

  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save
---
INSERT INTO "tables" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2023-09-08 09:45:40.419855"], ["updated_at", "2023-09-08 09:45:40.419855"]]

    def set_table
      @table = Table.find(params[:id])
---
SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]