app/views/line_items/_line_item.html.erb

    <strong>Order:</strong>
    <%= line_item.order_id %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."order_id" = $1 LIMIT $2  [["order_id", "8a820015-c420-4f33-a150-aa4965d0a721"], ["LIMIT", 1]]